/*****************************************************************************
// Copyright:   2014-2015, Hangzhou Thingcom Information Technology. Co., Ltd.
// File name:   main_swsn_ed.c
// Description: 主函数所在源文件.
// Author:      Leidi
// Version:     1.2
// Date:        2012-3-24
*****************************************************************************/

#include "swsn_lib.h"
#include "mrfi_board_defs.h"

/**************************************************************************************************
 * @fn          main
 *
 * @brief       节点模块的主函数.
 *
 * @param       none
 *
 * @return      none
 **************************************************************************************************
 */
void main (void) 
{
 //版级资源初始化
  
  BSP_Init();   
  
  swsn_info_init();       

  while(1)
  {  
    swsn_app_proc();
  }
  
}


/**************************************************************************************************
 */
