/*****************************************************************************
// Copyright:   2014-2015, Hangzhou Thingcom Information Technology. Co., Ltd.
// File name:   68_frm_proc.h
// Description: User APP.
//              SWSN网络内部帧的处理.
// Author:      Leidi
// Version:     1.0
// Date:        2014-10-21
// History:     2014-10-21  Leidi 使用新的函数原型proc_68_frm().
*****************************************************************************/

#ifndef __68_FRM_PROC_H
#define __68_FRM_PROC_H

/* ------------------------------------------------------------------------------------------------
 *                                            Includes
 * ------------------------------------------------------------------------------------------------
 */
#include "gtway_frm_proc.h"
#include "nwk_layer.h"

/* ------------------------------------------------------------------------------------------------
 *                                            Prototypes
 * ------------------------------------------------------------------------------------------------
 */
void proc_68_frm(const gtway_pkg_t *pIn_gtway_pkg, uint8_t *pOut_msg, uint8_t *pOut_len);

uint8_t send_net_pkg(linkID_t lid,uint8_t *,uint8_t );
uint8_t send_bcast_pkg(uint8_t *,uint8_t );

#endif

/**************************************************************************************************
 */
 
